Repository: lubenard/python-docs-fr
Catalog: library/warnings.po
Languages: fr

source: :mod:`warnings` --- Warning control
fr: :mod:`warnings` --- Contrôle des alertes

source: **Source code:** :source:`Lib/warnings.py`
fr: **Code source:** :source:`Lib/warnings.py`

source: Warning messages are typically issued in situations where it is useful to alert the user of some condition in a program, where that condition (normally) doesn't warrant raising an exception and terminating the program. For example, one might want to issue a warning when a program uses an obsolete module.
fr: Les messages d'avertissement sont généralement émis dans les situations où il est utile d'alerter l'utilisateur d'un problème dans un programme, lorsque cette condition ne justifie (normalement) pas de lever une exception et de terminer le programme. Par exemple, on peut vouloir émettre un avertissement lorsqu'un programme utilise un module obsolète.

source: Python programmers issue warnings by calling the :func:`warn` function defined in this module. (C programmers use :c:func:`PyErr_WarnEx`; see :ref:`exceptionhandling` for details).
fr: Les programmeurs Python émettent des avertissements en appelant la fonction :func:`warn' définie dans ce module. (Les développeurs C utilisent :c:func:`PyErr_WarnEx` ; voir :ref:`exception handling` pour les détails).

source: Warning messages are normally written to ``sys.stderr``, but their disposition can be changed flexibly, from ignoring all warnings to turning them into exceptions. The disposition of warnings can vary based on the warning category (see below), the text of the warning message, and the source location where it is issued. Repetitions of a particular warning for the same source location are typically suppressed.
fr: Les messages d'avertissement sont normalement écrits dans ``sys.stderr``, mais leur affichage peut être modifiée de manière flexible, passant d'ignorer tous les avertissements à les transformer en exceptions. La disposition des avertissements peut varier en fonction de la catégorie d'avertissement (voir ci-dessous), du texte du message d'avertissement et de d'où il est émis. Les répétitions d'un avertissement particulier pour le même emplacement source sont généralement supprimées.

source: There are two stages in warning control: first, each time a warning is issued, a determination is made whether a message should be issued or not; next, if a message is to be issued, it is formatted and printed using a user-settable hook.
fr: La commande d'avertissement comporte deux étapes : premièrement, chaque fois qu'un avertissement est émis, le module détermine si un message doit être émis ou non ; ensuite, si un message doit être émis, il est formaté et imprimé en utilisant un crochet réglable par l'utilisateur.

source: The determination whether to issue a warning message is controlled by the warning filter, which is a sequence of matching rules and actions. Rules can be added to the filter by calling :func:`filterwarnings` and reset to its default state by calling :func:`resetwarnings`.
fr: La détermination de l'émission d'un message d'avertissement est contrôlée par le filtre d'avertissement, qui est une séquence de règles et de leurs actions correspondantes. Des règles peuvent être ajoutées au filtre en appelant :func:`filter warnings` et remises à leur état par défaut en appelant :func:`resetwarnings`.

source: The printing of warning messages is done by calling :func:`showwarning`, which may be overridden; the default implementation of this function formats the message by calling :func:`formatwarning`, which is also available for use by custom implementations.
fr: L'affichage des messages d'avertissement se fait en appelant :func:`show warning`, qui peut être redéfinie ; l'implémentation par défaut de cette fonction formate le message en appelant :func:`format warning`, qui peut également être réutilisépour une implémentation personnalisée.

source: :func:`logging.captureWarnings` allows you to handle all warnings with the standard logging infrastructure.
fr: :func:`logging.captureWarnings` vous permet de gérer tous les avertissements avec l'infrastructure de journalisation standard.

source: Warning Categories
fr: Catégories d'avertissement

source: There are a number of built-in exceptions that represent warning categories. This categorization is useful to be able to filter out groups of warnings.
fr: Il existe un certain nombre d'exceptions intégrées qui représentent des catégories d'avertissement. Cette catégorisation est utile pour filtrer les groupes d'avertissements.

source: While these are technically :ref:`built-in exceptions <warning-categories-as-exceptions>`, they are documented here, because conceptually they belong to the warnings mechanism.
fr: Bien qu'il s'agisse techniquement d'exceptions, les :ref:`built-in exceptions <warning-categories-as-exceptions>` sont documentées ici, parce qu'elles appartiennent conceptuellement au mécanisme des avertissements.

source: User code can define additional warning categories by subclassing one of the standard warning categories. A warning category must always be a subclass of the :exc:`Warning` class.
fr: Le code utilisateur peut définir des catégories d'avertissement supplémentaires en sous-classant l'une des catégories d'avertissement standard. Une catégorie d'avertissement doit toujours être une sous-classe de la classe :exc:`Warning`.

source: The following warnings category classes are currently defined:
fr: Les classes de catégories d'avertissement suivantes sont actuellement définies :

source: Class
fr: Classe

source: This is the base class of all warning category classes. It is a subclass of :exc:`Exception`.
fr: Il s'agit de la classe de base de toutes les classes de catégories d'avertissement. C'est une sous-classe de :exc:`Exception`.

source: The default category for :func:`warn`.
fr: Catégorie par défaut pour :func:`warn`.

source: Base category for warnings about deprecated features when those warnings are intended for other Python developers (ignored by default, unless triggered by code in ``__main__``).
fr: Catégorie de base pour les avertissements sur les fonctionnalités obsolètes lorsque ces avertissements sont destinés à d'autres développeurs Python (ignorées par défaut, sauf si déclenchées par le code de ``__main__``).

source: Base category for warnings about dubious syntactic features.
fr: Catégorie de base pour les avertissements concernant des caractéristiques syntaxiques douteuses.

source: Base category for warnings about dubious runtime features.
fr: Catégorie de base pour les avertissements concernant les fonctionnalités douteuses à l'exécution.

source: Base category for warnings about deprecated features when those warnings are intended for end users of applications that are written in Python.
fr: Catégorie de base pour les avertissements concernant les fonctionnalités obsolètes lorsque ces avertissements sont destinés aux utilisateurs finaux des programmes écrits en Python.

source: Base category for warnings about features that will be deprecated in the future (ignored by default).
fr: Catégorie de base pour les avertissements concernant les fonctionnalités qui seront obsolètes dans le futur (ignorée par défaut).

source: Base category for warnings triggered during the process of importing a module (ignored by default).
fr: Catégorie de base pour les avertissements déclenchés lors de l'importation d'un module (ignoré par défaut).

source: Base category for warnings related to Unicode.
fr: Catégorie de base pour les avertissements relatifs à Unicode.

source: Base category for warnings related to :class:`bytes` and :class:`bytearray`.
fr: Catégorie de base pour les avertissements relatifs à :class:`bytes` et class:`bytearray`.

source: Base category for warnings related to resource usage.
fr: Catégorie de base pour les avertissements relatifs à l'utilisation des ressources.

source: Previously :exc:`DeprecationWarning` and :exc:`FutureWarning` were distinguished based on whether a feature was being removed entirely or changing its behaviour. They are now distinguished based on their intended audience and the way they're handled by the default warnings filters.
fr: Avant, :exc:`DeprecationWarning` et :exc:`FutureWarning` se différencient selon qu'un élément était entièrement supprimé ou qu'il modifiait son comportement. Ils se différencient désormais en fonction de leur public cible et de la façon dont ils sont traités par les filtres d'avertissement par défaut.

source: The Warnings Filter
fr: Le filtre des avertissements

source: The warnings filter controls whether warnings are ignored, displayed, or turned into errors (raising an exception).
fr: Le filtre des avertissements contrôle si les avertissements sont ignorés, affichés ou transformés en erreurs (ce qui lève une exception).

source: Conceptually, the warnings filter maintains an ordered list of filter specifications; any specific warning is matched against each filter specification in the list in turn until a match is found; the filter determines the disposition of the match. Each entry is a tuple of the form (*action*, *message*, *category*, *module*, *lineno*), where:
fr: Conceptuellement, le filtre d'avertissements maintient une liste ordonnée de spécifications de filtre ; tout avertissement spécifique est comparé à chaque spécification de filtre dans la liste jusqu'à ce qu'une correspondance soit trouvée ; le filtre détermine la disposition de la correspondance. Chaque entrée est un quintuplet de la forme (*action*, *message*, *catégorie*, *module*, *lineno*), où :

source: *action* is one of the following strings:
fr: *action* est l'une des chaînes de caractères suivantes :

source: Value
fr: Valeur

source: print the first occurrence of matching warnings for each location (module + line number) where the warning is issued
fr: affiche la première occurrence des avertissements correspondants pour chaque emplacement (module + numéro de ligne) où l'avertissement est émis

source: turn matching warnings into exceptions
fr: transforme les avertissements correspondants en exceptions

source: never print matching warnings
fr: ignore les avertissements correspondants

source: always print matching warnings
fr: affiche dans tous les cas les avertissements correspondants

source: print the first occurrence of matching warnings for each module where the warning is issued (regardless of line number)
fr: affiche la première occurrence des avertissements correspondants pour chaque module où l'avertissement est émis (quel que soit le numéro de ligne)

source: print only the first occurrence of matching warnings, regardless of location
fr: n'imprime que la première occurrence des avertissements correspondants, quel que soit l'endroit où ils se trouvent

source: *message* is a string containing a regular expression that the start of the warning message must match. The expression is compiled to always be case-insensitive.
fr: *message* est une chaîne de caractères contenant une expression régulière avec laquelle le début du message d'avertissement doit correspondre. L'expression est compilée pour être toujours insensible à la casse.

source: *category* is a class (a subclass of :exc:`Warning`) of which the warning category must be a subclass in order to match.
fr: *category* est une classe (une sous-classe de :exc:`Warning`) dont la catégorie d'avertissement doit être une sous-classe afin de correspondre.

source: *module* is a string containing a regular expression that the module name must match. The expression is compiled to be case-sensitive.
fr: *module* est une chaîne de caractères contenant une expression régulière avec laquelle le nom du module doit correspondre. L'expression est compilée pour être sensible à la casse.

source: *lineno* is an integer that the line number where the warning occurred must match, or ``0`` to match all line numbers.
fr: *lineno* est un nombre entier avec lequel le numéro de ligne où l'avertissement a eu lieu doit correspondre, ou ``0`` pour correspondre à tous les numéros de ligne.

source: Since the :exc:`Warning` class is derived from the built-in :exc:`Exception` class, to turn a warning into an error we simply raise ``category(message)``.
fr: Depuis que la classe :exc:`Warning' est dérivée de la classe native :exc:`Exception', pour transformer un avertissement en erreur, il suffit de lever ``category(message)``.

source: If a warning is reported and doesn't match any registered filter then the "default" action is applied (hence its name).
fr: Si un avertissement est signalé et ne correspond à aucun filtre enregistré, l'action "default" est appliquée (d'où son nom).

source: Describing Warning Filters
fr: Description des filtres d'avertissement

source: The warnings filter is initialized by :option:`-W` options passed to the Python interpreter command line and the :envvar:`PYTHONWARNINGS` environment variable. The interpreter saves the arguments for all supplied entries without interpretation in ``sys.warnoptions``; the :mod:`warnings` module parses these when it is first imported (invalid options are ignored, after printing a message to ``sys.stderr``).
fr: Le filtre des avertissements est initialisé par les options :option:`-W` passées à la ligne de commande de l'interpréteur Python et la variable d'environnement :envvar:`PYTHONWARNINGS`. L'interpréteur enregistre les arguments de toutes les entrées fournies sans interprétation dans ``sys.warnoptions`` ; le module :mod:``warnings` les analyse lors de la première importation (les options invalides sont ignorées, après impression d'un message à ``sys.stderr``).

source: Individual warnings filters are specified as a sequence of fields separated by colons::
fr: Les filtres d'avertissement individuels sont décrits sous la forme d'une séquence de champs séparés par des deux-points ::

source: The meaning of each of these fields is as described in :ref:`warning-filter`. When listing multiple filters on a single line (as for :envvar:`PYTHONWARNINGS`), the individual filters are separated by commas,and the filters listed later take precedence over those listed before them (as they're applied left-to-right, and the most recently applied filters take precedence over earlier ones).
fr: La signification de chacun de ces champs est décrite dans :ref:`warning-filter`. Lorsque vous lisez plusieurs filtres sur une seule ligne (comme pour :envvar:`PYTHONWARNINGS`), les filtres individuels sont séparés par des virgules, et les filtres listés plus tard ont priorité sur ceux qui les précèdent (car ils sont appliqués de gauche à droite, et les filtres les plus récemment appliqués ont priorité sur les précédents).

source: Commonly used warning filters apply to either all warnings, warnings in a particular category, or warnings raised by particular modules or packages. Some examples::
fr: Les filtres d'avertissement couramment utilisés s'appliquent à tous les avertissements, aux avertissements d'une catégorie particulière ou aux avertissements émis par certains modules ou paquets. Quelques exemples ::

source: Default Warning Filter
fr: Filtre d'avertissement par défaut

source: By default, Python installs several warning filters, which can be overridden by the :option:`-W` command-line option, the :envvar:`PYTHONWARNINGS` environment variable and calls to :func:`filterwarnings`.
fr: Par défaut, Python installe plusieurs filtres d'avertissement, qui peuvent être outrepassés par l'option :option:`-W` en ligne de commande, la variable d'environnement :envvar:`PYTHONWARNINGS` et les appels à :func:`filterwarnings`.

source: In regular release builds, the default warning filter has the following entries (in order of precedence)::
fr: Dans les versions standard publiées de Python, le filtre d'avertissement par défaut a les entrées suivantes (par ordre de priorité) ::

source: In debug builds, the list of default warning filters is empty.
fr: Dans les versions de débogage, la liste des filtres d'avertissement par défaut est vide.

source: :exc:`DeprecationWarning` is now ignored by default in addition to :exc:`PendingDeprecationWarning`.
fr: :exc:`DeprecationWarning` est maintenant ignoré par défaut en plus de :exc:`PendingDeprecationWarning`.

source: :exc:`DeprecationWarning` is once again shown by default when triggered directly by code in ``__main__``.
fr: :exc:`DeprecationWarning` est à nouveau affiché par défaut lorsqu'il est déclenché directement par code dans ``__main__``.

source: :exc:`BytesWarning` no longer appears in the default filter list and is instead configured via :data:`sys.warnoptions` when :option:`-b` is specified twice.
fr: :exc:`BytesWarning` n'apparaît plus dans la liste de filtres par défaut et est configuré via :data:`sys.warnoptions` lorsque l'option:`-b` est spécifiée deux fois.

source: Overriding the default filter
fr: Outrepasser le filtre par défaut

source: Developers of applications written in Python may wish to hide *all* Python level warnings from their users by default, and only display them when running tests or otherwise working on the application. The :data:`sys.warnoptions` attribute used to pass filter configurations to the interpreter can be used as a marker to indicate whether or not warnings should be disabled::
fr: Les développeurs d'applications écrites en Python peuvent souhaiter cacher *tous* les* avertissements de niveau Python à leurs utilisateurs par défaut, et ne les afficher que lorsqu'ils exécutent des tests ou travaillent sur l'application. L'attribut :data:`sys.warnoptions` utilisé pour passer les configurations de filtre à l'interpréteur peut être utilisé comme marqueur pour indiquer si les avertissements doivent être ou non désactivés ::

source: Developers of test runners for Python code are advised to instead ensure that *all* warnings are displayed by default for the code under test, using code like::
fr: Les développeurs d'exécuteurs de test pour le code Python sont invités à s'assurer que *tous* les avertissements sont affichés par défaut pour le code en cours de test, en utilisant un code comme::

source: Finally, developers of interactive shells that run user code in a namespace other than ``__main__`` are advised to ensure that :exc:`DeprecationWarning` messages are made visible by default, using code like the following (where ``user_ns`` is the module used to execute code entered interactively)::
fr: Enfin, les développeurs d'interpréteurs de commandes interactifs qui exécutent du code utilisateur dans un espace de nommage autre que ``__main__`` sont invités à s'assurer que les messages :exc:`DeprecationWarning` sont rendus visibles par défaut, en utilisant le code suivant (où ``user_ns'' est le module utilisé pour exécuter le code entré interactivement): :

source: Temporarily Suppressing Warnings
fr: Suppression Temporaire des Avertissements

source: If you are using code that you know will raise a warning, such as a deprecated function, but do not want to see the warning (even when warnings have been explicitly configured via the command line), then it is possible to suppress the warning using the :class:`catch_warnings` context manager::
fr: Si vous utilisez un code dont vous savez qu'il va déclencher un avertissement, comme une fonction obsolète, mais que vous ne voulez pas voir l'avertissement (même si les avertissements ont été explicitement configurés via la ligne de commande), alors il est possible de supprimer l'avertissement en utilisant le gestionnaire de contexte :class:`catch_warnings': :

source: While within the context manager all warnings will simply be ignored. This allows you to use known-deprecated code without having to see the warning while not suppressing the warning for other code that might not be aware of its use of deprecated code. Note: this can only be guaranteed in a single-threaded application. If two or more threads use the :class:`catch_warnings` context manager at the same time, the behavior is undefined.
fr: Dans le gestionnaire de contexte, tous les avertissements sont simplement ignorés. Ceci vous permet d'utiliser du code déclaré obsolète sans voir l'avertissement tout en ne supprimant pas l'avertissement pour un autre code qui pourrait ne pas être conscient de son utilisation de code déprécié. Remarque : ceci ne peut être garanti que dans une application à filetage unique. Si deux ou plusieurs threads utilisent le gestionnaire de contexte :class:`catch_warnings' en même temps, le comportement est indéfini.

source: Testing Warnings
fr: Tester les avertissements

source: To test warnings raised by code, use the :class:`catch_warnings` context manager. With it you can temporarily mutate the warnings filter to facilitate your testing. For instance, do the following to capture all raised warnings to check::
fr: Pour tester les avertissements générés par le code, utilisez le gestionnaire de contexte :class:`catch_warnings'. Avec lui, vous pouvez temporairement muter le filtre d'avertissements pour faciliter votre test. Par exemple, procédez comme suit pour capturer tous les avertissements levés à vérifier::

source: One can also cause all warnings to be exceptions by using ``error`` instead of ``always``. One thing to be aware of is that if a warning has already been raised because of a ``once``/``default`` rule, then no matter what filters are set the warning will not be seen again unless the warnings registry related to the warning has been cleared.
fr: Vous pouvez aussi faire en sorte que tous les avertissements soient des exceptions en utilisant "erreur" au lieu de "toujours". Il faut savoir que si un avertissement a déjà été émis à cause d'une règle "une fois" ou "par défaut", quel que soit le filtre activé, l'avertissement ne sera pas revu à moins que le registre des avertissements lié à l'avertissement ait été supprimé.

source: Once the context manager exits, the warnings filter is restored to its state when the context was entered. This prevents tests from changing the warnings filter in unexpected ways between tests and leading to indeterminate test results. The :func:`showwarning` function in the module is also restored to its original value. Note: this can only be guaranteed in a single-threaded application. If two or more threads use the :class:`catch_warnings` context manager at the same time, the behavior is undefined.
fr: Une fois que le gestionnaire de contexte se termine, le filtre des avertissements est restauré dans son état au moment où le contexte a été saisi. Cela empêche les tests de changer le filtre d'avertissements de manière inattendue entre les tests et d'aboutir à des résultats de test indéterminés. La fonction :func:`show warning` du module est également restaurée à sa valeur originale. Remarque : ceci ne peut être garanti que dans une application à filetage unique. Si deux ou plusieurs fils d'exécutionutilisent le gestionnaire de contexte :class:`catch_warnings' en même temps, le comportement est indéfini.

source: When testing multiple operations that raise the same kind of warning, it is important to test them in a manner that confirms each operation is raising a new warning (e.g. set warnings to be raised as exceptions and check the operations raise exceptions, check that the length of the warning list continues to increase after each operation, or else delete the previous entries from the warnings list before each new operation).
fr: Lorsque vous testez plusieurs opérations qui provoquent le même type d'avertissement, il est important de les tester d'une manière qui confirme que chaque opération provoque un nouvel avertissement (par exemple, définissez les avertissements comme exceptions et vérifiez que les opérations provoquent des exceptions, vérifiez que la longueur de la liste des avertissements continue à augmenter après chaque opération, ou bien supprimez les entrées précédentes de la liste des avertissements avant chaque nouvelle opération).
