Repository: lubenard/python-docs-fr
Catalog: library/warnings.po
Languages: fr

source: Updating Code For New Versions of Dependencies
fr: Mise à jour du Code pour les Nouvelles Versions des Dépendances

source: Warning categories that are primarily of interest to Python developers (rather than end users of applications written in Python) are ignored by default.
fr: Les catégories d'avertissement qui intéressent principalement les développeurs Python (plutôt que les utilisateurs finaux d'applications écrites en Python) sont ignorées par défaut.

source: Notably, this "ignored by default" list includes :exc:`DeprecationWarning` (for every module except ``__main__``), which means developers should make sure to test their code with typically ignored warnings made visible in order to receive timely notifications of future breaking API changes (whether in the standard library or third party packages).
fr: Notamment, cette liste "ignorés par défaut" inclut :exc:`DeprecationWarning` (pour chaque module sauf ``__main__``), ce qui signifie que les développeurs doivent s'assurer de tester leur code avec des avertissements généralement ignorés rendus visibles afin de recevoir des notifications rapides des changements d'API (que ce soit dans la bibliothèque standard ou les paquets tiers).

source: In the ideal case, the code will have a suitable test suite, and the test runner will take care of implicitly enabling all warnings when running tests (the test runner provided by the :mod:`unittest` module does this).
fr: Dans le cas idéal, le code dispose d'une suite de tests appropriée, et le testeur se charge d'activer implicitement tous les avertissements lors de l'exécution des tests (le testeur fourni par le module :mod:`unittest' le fait).

source: In less ideal cases, applications can be checked for use of deprecated interfaces by passing :option:`-Wd <-W>` to the Python interpreter (this is shorthand for :option:`!-W default`) or setting ``PYTHONWARNINGS=default`` in the environment. This enables default handling for all warnings, including those that are ignored by default. To change what action is taken for encountered warnings you can change what argument is passed to :option:`-W` (e.g. :option:`!-W error`). See the :option:`-W` flag for more details on what is possible.
fr: Dans des cas moins idéaux, les applications peuvent être vérifiées pour l'utilisation d'interfaces obsolètes en passant :option:`-Wd <-W>`à l'interpréteur Python (c'est une abréviation pour option:`!-W default`) ou en définissant ``PYTHONWARNINGS=default`` dans l'environnement. Ceci permet la gestion par défaut de tous les avertissements, y compris ceux qui sont ignorés par défaut. Pour changer l'action prise pour les avertissements rencontrés, vous pouvez changer quel argument est passé à :option:`-W` (par exemple:option:`!-W error`). Voir l'option :option:`-W` pour plus de détails sur ce qui est possible.

source: Available Functions
fr: Fonctions disponibles

source: Issue a warning, or maybe ignore it or raise an exception. The *category* argument, if given, must be a warning category class (see above); it defaults to :exc:`UserWarning`. Alternatively *message* can be a :exc:`Warning` instance, in which case *category* will be ignored and ``message.__class__`` will be used. In this case the message text will be ``str(message)``. This function raises an exception if the particular warning issued is changed into an error by the warnings filter see above. The *stacklevel* argument can be used by wrapper functions written in Python, like this::
fr: Émettre un avertissement, ou peut-être l'ignorer ou faire une exception. L'argument *categorie*, s'il est donné, doit être une classe de catégorie d'avertissement (voir ci-dessus) ; il est par défaut :exc:`UserWarning'. Alternativement *message* peut être une instance :exc:`Warning', auquel cas *categorie* sera ignoré et ``message.__class__`` sera utilisé. Dans ce cas, le texte du message sera ``str(message)``. Cette fonction lève une exception si cet l'avertissement particulier émis est transformé en erreur par le filtre des avertissements voir ci-dessus. L'argument *stacklevel* peut être utilisé par les fonctions wrapper écrites en Python, comme ceci::

source: This makes the warning refer to :func:`deprecation`'s caller, rather than to the source of :func:`deprecation` itself (since the latter would defeat the purpose of the warning message).
fr: Ceci fait que l'avertissement se réfère à l'appelant de :func:`deprecation` plutôt qu'à la source de :func:`deprecation` elle-même (puisque celle-ci irait à l'encontre du but du message d'avertissement).

source: *source*, if supplied, is the destroyed object which emitted a :exc:`ResourceWarning`.
fr: *source*, s'il est fourni, est l'objet détruit qui a émis un :exc:`ResourceWarning`.

source: Added *source* parameter.
fr: Ajout du paramètre *source*.

source: This is a low-level interface to the functionality of :func:`warn`, passing in explicitly the message, category, filename and line number, and optionally the module name and the registry (which should be the ``__warningregistry__`` dictionary of the module). The module name defaults to the filename with ``.py`` stripped; if no registry is passed, the warning is never suppressed. *message* must be a string and *category* a subclass of :exc:`Warning` or *message* may be a :exc:`Warning` instance, in which case *category* will be ignored.
fr: Il s'agit d'une interface de bas niveau pour la fonctionnalité de :func:`warn`, en passant explicitement le message, la catégorie, le nom de fichier et le numéro de ligne, et éventuellement le nom du module et le registre (qui devrait être le dictionnaire ``__warningregistry__`` du module). Le nom de module par défaut est le nom de fichier avec ``.py`` dépouillé ; si aucun registre n'est passé, l'avertissement n'est jamais supprimé. *message* doit être une chaîne de caractères et *category* une sous-classe de :exc:`Warning' ou *message* peut être une instance:exc:`Warning', auquel cas *category* sera ignoré.

source: *module_globals*, if supplied, should be the global namespace in use by the code for which the warning is issued. (This argument is used to support displaying source for modules found in zipfiles or other non-filesystem import sources).
fr: *module_globals*, s'il est fourni, doit être l'espace de nommage global utilisé par le code pour lequel l'avertissement est émis. (Cet argument est utilisé pour afficher les sources des modules trouvés dans les fichiers zip ou d'autres sources d'importation non système de fichiers).

source: Add the *source* parameter.
fr: Ajouter le paramètre *source*.

source: Write a warning to a file. The default implementation calls ``formatwarning(message, category, filename, lineno, line)`` and writes the resulting string to *file*, which defaults to ``sys.stderr``. You may replace this function with any callable by assigning to ``warnings.showwarning``. *line* is a line of source code to be included in the warning message; if *line* is not supplied, :func:`showwarning` will try to read the line specified by *filename* and *lineno*.
fr: Ecrire un avertissement dans un fichier. L'implémentation par défaut appelle ``format warning(message, category, filename, lineno, line)``et écrit la chaîne résultante dans *file*, qui par défaut est ``sys.stderr``. Vous pouvez remplacer cette fonction par n'importe quel appelable en l'affectant à ``warnings.showwarning``. *line* est une ligne de code source à inclure dans le message d'avertissement ; si *line* n'est pas fourni, :func:`show warning' essaiera de lire la ligne spécifiée par *filename* et *lineno*.

source: Format a warning the standard way. This returns a string which may contain embedded newlines and ends in a newline. *line* is a line of source code to be included in the warning message; if *line* is not supplied, :func:`formatwarning` will try to read the line specified by *filename* and *lineno*.
fr: Formate un avertissement de la manière standard. Ceci retourne une chaîne qui peut contenir des nouvelles lignes incorporées et se termine par une nouvelle ligne. *line* est une ligne de code source à inclure dans le message d'avertissement ; si *line* n'est pas fourni, :func:`format warning` essaiera de lire la ligne spécifiée par *filename* et *lineno*.

source: Insert an entry into the list of :ref:`warnings filter specifications <warning-filter>`. The entry is inserted at the front by default; if *append* is true, it is inserted at the end. This checks the types of the arguments, compiles the *message* and *module* regular expressions, and inserts them as a tuple in the list of warnings filters. Entries closer to the front of the list override entries later in the list, if both match a particular warning. Omitted arguments default to a value that matches everything.
fr: Insère une entrée dans la liste de :ref:`warning filter specifications <warning-filter>`. L'entrée est insérée à l'avant par défaut ; si *append* est vrai, elle est insérée à la fin. Il vérifie le type des arguments, compile les expressions régulières *message* et *module*, et les insère sous forme de tuple dans la liste des filtres d'avertissements. Les entrées plus proches du début de la liste remplacent les entrées plus tard dans la liste, si les deux correspondent à un avertissement particulier. Les arguments omis ont par défaut une valeur qui correspond à tout.

source: Insert a simple entry into the list of :ref:`warnings filter specifications <warning-filter>`. The meaning of the function parameters is as for :func:`filterwarnings`, but regular expressions are not needed as the filter inserted always matches any message in any module as long as the category and line number match.
fr: Insère une entrée simple dans la liste de :ref:`spécifications du filtre d'avertissements <warnings filter specifications>`. La signification des paramètres de fonction est la même que pour :func:`filter warning`, mais les expressions régulières ne sont pas nécessaires car le filtre inséré correspond toujours à n'importe quel message dans n'importe quel module tant que la catégorie et le numéro de ligne correspondent.

source: Reset the warnings filter. This discards the effect of all previous calls to :func:`filterwarnings`, including that of the :option:`-W` command line options and calls to :func:`simplefilter`.
fr: Réinitialise le filtre des avertissements. Ceci supprime l'effet de tous les appels précédents vers :func:`filter warnings`, y compris celui de l'option:`-W' des options de ligne de commande et des appels vers :func:`simplefilter`.

source: Available Context Managers
fr: Gestionnaires de Contexte Disponibles

source: A context manager that copies and, upon exit, restores the warnings filter and the :func:`showwarning` function. If the *record* argument is :const:`False` (the default) the context manager returns :class:`None` on entry. If *record* is :const:`True`, a list is returned that is progressively populated with objects as seen by a custom :func:`showwarning` function (which also suppresses output to ``sys.stdout``). Each object in the list has attributes with the same names as the arguments to :func:`showwarning`.
fr: Un gestionnaire de contexte qui copie et, à la sortie, restaure le filtre des avertissements et la fonction :func:`show warning`. Si l'argument *record* est :const:`False' (par défaut), le gestionnaire de contexte retourne :class:`None' à l'entrée. Si *record* est :const:`True', une liste est renvoyée qui est progressivement peuplée d'objets comme vu par une fonction custom :func:`show warning' (qui supprime également la sortie vers ``sys.stdout``). Chaque objet de la liste a des attributs avec les mêmes noms que les arguments de :func:`show warning`.

source: The *module* argument takes a module that will be used instead of the module returned when you import :mod:`warnings` whose filter will be protected. This argument exists primarily for testing the :mod:`warnings` module itself.
fr: L'argument *module* prend un module qui sera utilisé à la place du module renvoyé lors de l'importation :mod:`warnings` dont le filtre sera protégé. Cet argument existe principalement pour tester le module :mod:`warnings` lui-même.

source: The :class:`catch_warnings` manager works by replacing and then later restoring the module's :func:`showwarning` function and internal list of filter specifications. This means the context manager is modifying global state and therefore is not thread-safe.
fr: Le gestionnaire :class:`catch_warnings` fonctionne en remplaçant puis en restaurant plus tard la fonction :func:`show warning` du module et la liste interne des spécifications du filtre. Cela signifie que le gestionnaire de contexte modifie l'état global et n'est donc pas sûr pour le fil d'exécution.
